{"title":"Stencil Blog - Announcing Stencil 1.0.0","date":"June 6, 2019","url":"/blog/announcing-stencil-one","author":"Manu Almeida","description":"Today, we’re thrilled to announce the release of Stencil 1.0 final (what we’re calling Stencil One), featuring an all-new compiler architecture. It is not only able to better optimize your components, but is designed to be completely future-proof.","img":"/assets/img/blog/og/stencil-one.png","srcPath":"./src/blog/announcing-stencil-one.md","hypertext":["div",null,["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/stencil-one-beta.png","alt":""}]],"\n",["p",null,"Today, we’re thrilled to announce the release of Stencil 1.0 beta (what we’re calling ",["strong",null,"Stencil One"],"), featuring an all-new compiler architecture. It is not only able to better optimize your components, but is designed to be completely future-proof."],"\n",["p",null,["span",{"id":"more-2801"}]],"\n",["h2",{"id":"what-is-stencil"},"What is Stencil?"],"\n",["p",null,"If you’re not familiar with ",["a",{"href":"https://next.stenciljs.com/"},"Stencil"],", it is an open source (MIT) toolchain that builds reusable, scalable Design Systems by combining the best features from popular frontend frameworks and generating standard Web Components (instead of a third-party component model)."],"\n",["p",null,"Stencil was first announced in 2017 at ",["a",{"href":"https://www.youtube.com/watch?v=UfD-k7aHkQE"},"Polymer Summit"]," by my colleagues, ",["a",{"href":"https://github.com/adamdbradley"},"Adam Bradley"]," and ",["a",{"href":"https://github.com/mlynch"},"Max Lynch"],". Originally called “Ionic core” internally, Stencil was born out of our desire to solve our own JS Framework dependency problems and increase performance for Ionic Framework. As it turns out, Stencil ended up solving a lot more than that."],"\n",["p",null,"Building Stencil allowed us to ",["a",{"href":"https://blog.ionicframework.com/introducing-ionic-4-ionic-for-everyone/"},"release Ionic 4"]," for Angular, React, Vue, or for no framework at all, powering roughly 100 cross-platform UI components in two separate styles (iOS and Material Design). As a result, the Ionic Framework team is now able to focus 100% of its time on shipping the best collection of UI components, gestures, animations, etc. without having to worry about browser-support, framework integrations, or performance—as Stencil automatically applies these built-in best practices."],"\n",["p",null,"Over the last two years, we’ve been surprised and incredibly humbled by the groundswell of community adoption Stencil has garnered. The project has over 200 contributors around the world, with thousands of developers, teams, and large organizations building on it. Frankly, we couldn’t be more grateful!"],"\n",["p",null,"With that said, let’s dive into some of the exciting features shipping with Stencil One."],"\n",["h2",{"id":"machine-learning-inspired-bundling"},"Machine Learning-inspired Bundling"],"\n",["p",null,"Stencil One uses a new bundling algorithm inspired by ",["a",{"href":"https://en.wikipedia.org/wiki/Word_embedding"},"“word embedding”"],", a popular Machine Learning technique. It allows us to pack components more efficiently, therefore reducing the network throughput and round-trips. In order to do this, we generate a ",["em",null,"N-dimensional"]," vector space where each component represents a coordinate. These coordinates are generated based on the previous static analysis of how components depend on each other. Later, the components that are located close enough in the vectorial space are bundled together. A blog post explaining this technique will be coming soon!"],"\n",["p",null,"While we bundle components to reduce the number of scripts, Stencil relies on ES modules that execute natively in the browser. Today, all major browsers (Chrome, Firefox, Safari and Edge) implement ES2017 and ES modules, which means we don’t ship any runtime to load modules."],"\n",["p",null,"At the same time, we still support old browsers such as IE11, thanks to “",["a",{"href":"https://developers.google.com/web/fundamentals/primers/modules#browser"},"differential bundling"],"”, which automatically generates the smallest possible bundle for each browser based on their capabilities."],"\n",["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/Screenshot-2019-05-14-at-18.07.17-1024x527.png","alt":""}]],"\n",["p",null,"In addition, all the metadata collected by the compiler and the dependency graph generated by rollup can be used to automatically create ",["a",{"href":"https://developers.google.com/web/updates/2017/12/modulepreload"},"“modulepreload” links"],", reducing the amount of network round-trips required to download all the JS in the critical path to zero. This drastically reduces the Time-To-Interactive of apps built with Stencil."],"\n",["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/Screenshot-2019-05-14-at-18.15.41-1024x746.png","alt":""}]],"\n",["h2",{"id":"advanced-runtime-removal"},"Advanced Runtime Removal"],"\n",["p",null,"With the new compiler, Stencil now shrinks the size and number of bundles sent to users. The metadata collected during the static analysis phase is used together with tree-shaking to ",["em",null,"completely"]," remove the parts of the runtime that are not used."],"\n",["p",null,"While the ",["code",null,"hello-world"]," demo is clearly an artificial example, we are excited about being able to generate incredibly small dependency-free components that include only what they need. Our ",["strong",null,"133bytes Hello World app"]," (including runtime) is an example of the power of the compiler."],"\n",["p",null,"This optimization also scales as the complexity of the components increases. Here’s an example with the ",["a",{"href":"https://todomvc-stencil-one.firebaseapp.com/"},"TodoMVC app"],":"],"\n",["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/stencil-bundle-comparison-1024x569.png","alt":""}]],"\n",["h2",{"id":"jit-friendly-runtime"},"JIT-friendly Runtime"],"\n",["p",null,"We have also profiled and refactored the runtime to be smaller and much faster at execution-time. The new runtime avoids patterns that lead to non-optimal bytecode (usually called optimization killers), improves our async scheduler, and adopts new APIs like ",["a",{"href":"https://developers.google.com/web/updates/2019/02/constructable-stylesheets"},"Constructable Stylesheets"],", native ES modules, and ",["a",{"href":"https://v8.dev/blog/fast-async"},"native async-await"],"."],"\n",["p",null,"In this benchmark, we add 8,000 ",["code",null,"ion-button"]," components (yes, eight-THOUSAND) to an app. At first glance, ",["code",null,"ion-button"]," might appear simple, but it hides a great deal of complexity. It’s comprised of many classes and nested elements which give it the professional and polished visual appearance on both iOS and Android. Put another way, this stress test is attaching more than ",["em",null,"200,000"]," nodes to the DOM."],"\n",["p",null,"Historically, it took ~6 seconds to fully initialize the app with well over 269,000 nodes:"],"\n",["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/Screenshot-2019-05-14-at-19.13.23-1024x661.png","alt":""}]],"\n",["p",null,"With Stencil One, the exact same test finishes in 3 seconds. That’s ",["strong",null,"2x times faster"],"! In addition, the memory usage is reduced from ",["strong",null,"180MB to 80MB"],"."],"\n",["p",null,["img",{"src":"https://blog.ionicframework.com/wp-content/uploads/2019/05/Screenshot-2019-05-14-at-19.09.08-1024x661.png","alt":""}]],"\n",["p",null,"Best of all, Ionic developers don’t have to go through any painful rewrites. Instead, they will automatically unlock these performance improvements on their existing projects just from the compiler upgrade."],"\n",["h2",{"id":"a-lot-more-in-stencil-one"},"A lot more in Stencil One…"],"\n",["p",null,"The above is just a preview of some of the amazing features built into Stencil One. Here’s what else it will ship with:"],"\n",["ul",null,"\n",["li",null,"New prerendering architecture compatible with Shadow DOM and designed to be integrated with third party tools, such as ",["strong",null,"Angular Universal"],"."],"\n",["li",null,"Generation of raw web components that extend directly from HTMLElement."],"\n",["li",null,"A new and powerful plugin system for third party output targets."],"\n",["li",null,"A continuing effort to ensure Stencil is as future-proof as possible."],"\n",["li",null,"A new compiler architecture that relies on ECMA features instead of Typescript for metadata collection."],"\n",["li",null,"Better built-in generation of Service Workers."],"\n",["li",null,"Better asset generation for more efficient cache policies."],"\n"],"\n",["p",null,"We can’t wait to dive into all of these topics in upcoming blog posts!"],"\n",["h2",{"id":"building-a-design-system"},"Building a Design System?"],"\n",["p",null,"We provide expert Advisory services & Software to large companies around the world building out the Design Systems that their company’s software will be built on for years and years to come."],"\n",["p",null,"If you or your company would like our help along the way, as well as other software surrounding Stencil and Design Systems, check out our ",["a",{"href":"https://stenciljs.com/design-systems"},"Stencil DS"]," product offering for building future-proof, production-ready Design Systems at scale."],"\n",["h2",{"id":"try-the-beta"},"Try the Beta!"],"\n",["p",null,"We’d love for you to test out the Stencil One beta and to give us your early feedback. Upgrading your components to Stencil One is as easy as running the following command:"],"\n\n  ",["highlight-code",null,"\n    ",["pre",null,["code",null,"npm install @stencil/core@one"]],"\n  "],"\n      ",["p",null,"And remember to look at our ",["a",{"href":"https://github.com/ionic-team/stencil/blob/master/BREAKING_CHANGES.md"},"breaking-changes file"]," for any changes you might have to apply to your app."],"\n",["p",null,"We also released a ",["a",{"href":"https://next.stenciljs.com"},"new version of our Docs"],", documenting some of the new APIs of Stencil One."],"\n",["h2",{"id":"whats-next"},"What’s Next?"],"\n",["p",null,"The Stencil One 1.0 release sets an important milestone in the development of Stencil, switching focus from being solely an open sourced internal tool, to an actual product that can help any developer or company building design systems or blazing fast apps using pure web components."],"\n",["p",null,"We are currently targeting early June 2019 for the final release. This is just the beginning for Stencil."]]}